#예시값
# H=5  X=2  Y=1 => 4
# H=6  X=5  Y=1 => 2
# H=1000000000  X=100  Y=99 => 999999901


#1 내 오답: 정상에 도달하면 떨어지지 않는다는 점 간과
# H = int(input("나무 막대의 높이 H를 입력해주세요 : "))
# X = int(input("낮 동안 올라가는 높이 X를 입력해주세요 : "))
# Y = int(input("밤 동안 미끄러지는 높이 Y를 입력해주세요 : "))
# result = H//(X-Y)
# print("달팽이는", result, "일차에 정상에 도달할 수 있겠네요!")


#2 while 반복문을 활용한 경우: 다만 이건 숫자가 커지면 계산하는데 시간이 오래걸림
H = int(input("나무 막대의 높이 H를 입력해주세요: "))
X = int(input("낮 동안 올라가는 높이 X를 입력해주세요: "))
Y = int(input("밤 동안 미끄러지는 높이 Y를 입력해주세요: "))
day = 0
height = 0
StopFlag = False
while StopFlag == False:
    day = day + 1
    height = height + X
    if height >= H:
        StopFlag = True
    else:
        height = height - Y
print("달팽이는", day, "일차에 정상에 도달할 수 있겠네요!")


#3 while 반복문 없이 하는 경우
H = int(input("나무 막대의 높이 H를 입력해주세요: "))
X = int(input("낮 동안 올라가는 높이 X를 입력해주세요: "))
Y = int(input("밤 동안 미끄러지는 높이 Y를 입력해주세요: "))

if (H-Y) % (X-Y) == 0:
    day = (H-Y)//(X-Y)
else:
    day = (H-Y)//(X-Y)+1

print("달팽이는", day, "일차에 정상에 도달할 수 있겠네요!")

# H에서 왜 Y를 뺀 다음 (X-Y)로 나누지..?
# 문제를 바꿔생각해보면 이해해볼만하다
# 기존문제에서 정상에 도달하면 미끄러지지 않는다는 조건을 빼고
# 몇일 차에 달팽이가 처음으로 정상을 찍어보냐라는 질문으로 생각했을 때
# (질문을 다르지만 답은 같게 나오므로)
# 하루에 달팽이가 올라가는 높이는 (X-Y)이고,
# 막대높이(H)에서 미끄러지는 높이(Y)를 뺀 높이에 도달하거나 이를 처음으로 초과하는 날이
# 달팽이가 막대 정상을 찍고 내려온 날이 된다
# (X>Y 이기 때문에, (H-Y)에 도달하거나 이를 처음으로 초과했다는 뜻은 미끄러지기 전에 정상을 찍어봤다는 뜻이 됨)
# 달팽이가 움직이는 높이(X-Y)는 낮과 밤을 포함한 하루 전체를 기준으로 한 값인데
# 정상을 찍는 건 낮에 이뤄지는 일이기 때문에 하루를 기준으로 생각하면 달팽이는 최소 (H-Y) 만큼 올라가면 됨


